
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Не ЗначениеЗаполнено(Представитель) Тогда
		ПредупреждениеАсинх("Необходимо выбрать представителя");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		ПредупреждениеАсинх("Необходимо указать первый пароль");
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КонтактноеЛицо", Представитель);
	Результат.Вставить("Пароль", Пароль);
		
	ОповеститьОВыборе(Результат);

КонецПроцедуры
	
#КонецОбласти


